[
    {
        "periodical": "Measurement ",
        "title": "An improved ResNet method for urban flooding water depth estimation from social media images",
        "abstract": "Social media images featuring high timeliness, large data volume, and low cost, is utilized for flooding depth estimation. Common flood depth estimation methods are to segment each reference instance, resulting in local water depths and contradictory results. This study added Coordinate Attention into Residual Neural Network (ResNet), and proposed Coordinate Attention-Residual Neural Network (CA-ResNet) to acquire global submerged water depths. The 2021 Henan rainstorm in China was used as case study and a flooding dataset from Chinese Sina Microblog was constructed, with total 5676 images and 4189 flooded. All the flooded depths class 0–9 reflected from the images were annotated manually. The proposed CA-ResNet method was compared with VGGNet, ResNet, GoogleNet, and EfficientNet, both accuracy and F1 score improved by 1% − 3%. The average accuracy of level 0 – 8 within the error range of CA-ResNet reached 83.14%. It is proved that CA-ResNet could achieve flood depth estimation, facilitating efficient decision support for flood responding.",
        "date": "2024-11-12",
        "image_url": "https://ars.els-cdn.com/content/image/1-s2.0-S0263224124X00196-cov150h.gif",
        "paper_url": "https://doi.org/10.1016/j.measurement.2024.116114"
    },
    {
        "periodical": "Remote Sensing",
        "title": "DMBLC: An Indirect Urban Impervious Surface Area Extraction Approach by Detecting and Masking Background Land Cover on Google Earth Image",
        "abstract": "Implying the prosperity and development of the city, impervious surface area (ISA) is playing an increasingly important role in ecological processes, microclimate, material and energy flows, and urban flood. The free sub-meter resolution Google Earth image, which is integrated by several high spatial resolution data, appears to have potential for high-resolution ISA extraction, where present study is rare and performances remain to be improved. Due to the high spatial and spectral variation of the urban environment as well as confusion between ISA and soil, the accurate delineating of ISA with traditional (direct) methods can be costly and time-consuming, which is in a word resource-intensive. However, this paper presents a novel indirect ISA extraction conceptual model and a new detecting and masking background land cover (DMBLC) approach that: uses a freely available, high-resolution dataset; requires a reduced set of training samples; and consists of relatively simple, common, and feasible image processing steps. The key characteristic of DMBLC is to detect the background of ISA (vegetation, soil, and water) accurately and obtain the ISA by masking the background. The approach relies on background detection to avoid the predicaments of direct ISA extraction. Water can be directly gained by water body vector data, in DMBLC; mixture tuned matched filtering (MTMF) is exploited to detect vegetation and soil, image segmentation is used to mitigate the spectral variation problem within the same land cover, and segment rectangularity reduces the confusion between ISA and soil. From experiments in a core area of Fuzhou, China, the DMBLC approach reached high performance and outperformed the powerful traditional support vector machines (SVM) method (overall accuracy of 94.45% and Kappa coefficient of 0.8885, compared to 86.44% and 0.7329, respectively). From the comparison of different levels of complexity within the inner processing steps, it is confirmed that the DMBLC approach is a powerful and flexible changed framework for indirect ISA extraction, which can be improved by using more advanced inner methods.",
        "date": "2018-05-16",
        "image_url": "https://www.researchgate.net/publication/325198542/figure/fig3/AS:11431281211405119@1702398044522/The-framework-of-the-proposed-detecting-and-masking-background-land-cover-DMBLC.tif",
        "paper_url": "https://doi.org/10.3390/rs10050766"
    },
    {
        "periodical": "Environmental Modelling & Software",
        "title": "Sensor web - Enabled flood event process detection and instant service",
        "abstract": "Flood Detection and Service (FD&S) is of great significance to flood management and decision-making. But most of the state-of-art FD&S methods are weak in timeliness and extensibility, and could not reflect flood processes. To resolve the abovementioned problems, this paper proposed the process-based FD&S (PFD&S) method based on Sensor Web. PFD&S is a four-layer architecture the core components of which are the access adapter and process-based detection rules and it is capable of heterogeneous sensor access, flood detection, and flood phase adaptive services. A prototype was developed based on the PFD&S method. Two floods occurring in the Huanghan basin (Hubei, China, with the area of 5.04 × 10 ⁴ km ² ) during July 2016, was selected as the case studies to validate the PFD&S method and prototype. The results demonstrated that the proposed PFD&S method and prototype could achieve the instant flood process detection and services in 2.7 min.",
        "date": "2019-03-23",
        "image_url": "https://tpc.googlesyndication.com/simgad/2196466225796190144",
        "paper_url": "https://doi.org/10.1016/j.envsoft.2019.03.004"
    },
    {
        "periodical": "ISPRS International Journal of Geo-Information",
        "title": "PM2.5 Estimation and Spatial-Temporal Pattern Analysis Based on the Modified Support Vector Regression Model and the 1 km Resolution MAIAC AOD in Hubei, China",
        "abstract": "The satellite-retrieved Aerosol Optical Depth (AOD) is widely used to estimate the concentrations and analyze the spatiotemporal pattern of Particulate Matter that is less than or equal to 2.5 microns (PM2.5), also providing a way for the related research of air pollution. Many studies generated PM2.5 concentration networks with resolutions of 3 km or 10 km. However, the relatively coarse resolution of the satellite AOD products make it difficult to determine the fine-scale characteristics of PM2.5 distributions that are important for urban air quality analysis. In addition, the composition and chemical properties of PM2.5 are relatively complex and might be affected by many factors, such as meteorological and land cover type factors. In this paper, an AOD product with a 1 km spatial resolution derived from the Multi-Angle Implementation of Atmospheric Correction (MAIAC) algorithm, the PM2.5 measurements from ground sites and the meteorological data as the auxiliary variable, are integrated into the Modified Support Vector Regression (MSVR) model that proposed in this paper to estimate the PM2.5 concentrations and analyze the spatiotemporal pattern of PM2.5. Considering the relatively small dataset and the somewhat complex relationship between the variables, we propose a Modified Support Vector Regression (MSVR) model that based on SVR to fit and estimate the PM2.5 concentrations in Hubei province of China. In this paper, we obtained Cross Correlation Coefficient (R²) of 0.74 for the regression of independent and dependent variables, and the conventional SVR model obtained R² of 0.60 as comparison. We think our MSVR model obtained relatively good performance in spite of many complex factors that might impact the accuracy. We then utilized the optimal MSVR model to perform the PM2.5 estimating, analyze their spatiotemporal patterns, and try to explain the possible reasons for these patterns. The results showed that the PM2.5 estimations retrieved from 1 km MAIAC AOD could reflect more detailed spatial distribution characteristics of PM2.5 and have higher accuracy than that from 3 km MODIS AOD. Therefore, the proposed MSVR model can be a better method for PM2.5 estimating, especially when the dataset is relatively small.",
        "date": "2021-01-13",
        "image_url": "https://www.mdpi.com/ijgi/ijgi-10-00031/article_deploy/html/images/ijgi-10-00031-g002-550.jpg",
        "paper_url": "https://doi.org/10.3390/ijgi10010031"
    },
    {
        "periodical": "GIScience & Remote Sensing",
        "title": "An on-demand scheme driven by the knowledge of geospatial distribution for large-scale high-resolution impervious surface mapping",
        "abstract": "Impervious surface has become one of the key factors of regional environmental problems and disasters. There rises an urgent need for mapping large-scale high-resolution impervious surfaces to help delicate modeling and overall planning. In the existing large-scale impervious surface mapping studies, there are many studies and products at medium resolution (10 ~ 100 m), some of which are with time series; while only few are at high resolution (<10 m), but not appeared with temporal updates. In the conventional scheme for large-scale high-resolution mapping, plenty of high-resolution imagery (HRI) are required to cover the entire large area and achieve wider coverage as much as possible. The high cost of obtaining abundant HRI limits large-scale high-resolution impervious surface mapping, leading to rare high-resolution impervious surface study at large scales. To alleviate the difficulties in the conventional scheme, an on-demand HRI scheme was proposed based on geos`patial distribution knowledge (low overall proportion and high geospatial aggregation) of impervious surface at large scales, with the advantage of reducing the demand for HRI while ensuring coverage. Adopting the information and knowledge obtained from medium-resolution impervious surface data at large scales, the proposed on-demand HRI scheme only requires HRI where it is really needed, rather than for the entire large area as in the conventional scheme. Reducing the study area by a morphology-based method and selecting necessary HRI by the bidirectional image filtering (BIF) strategy, the on-demand HRI scheme has a smaller requirement of the HRI resources. The proposed on-demand HRI scheme and conventional scheme were implemented and discussed in five study areas. The results show that compared with the conventional method, the proposed on-demand HRI scheme reduced the requirement of HRI while ensuring coverage; and in the case of insufficient HRI coverage, it can reduce the HRI requirements while narrowing data gaps in the large-scale high-resolution impervious surface result. It was also found that the proposed scheme performs well in large-scale areas with low overall proportion and high geospatial aggregation of impervious surface found in the medium-resolution remote sensing product. Additionally, the on-demand HRI scheme will be also useful for large-scale high-resolution mapping of other land cover types.",
        "date": "2021-04-13",
        "image_url": "https://www.researchgate.net/profile/Min-Huang-34/publication/350864924/figure/fig5/AS:1012685202268160@1618454375086/The-workflow-of-the-on-demand-HRI-scheme-for-mapping-high-resolution-impervious-surface.png",
        "paper_url": "https://doi.org/10.1080/15481603.2021.1909304"
    },
    {
        "periodical": "Remote Sensing",
        "title": "Integrating Remote Sensing and a Markov-FLUS Model to Simulate Future Land Use Changes in Hokkaido, Japan",
        "abstract": "As the second largest island in Japan, Hokkaido provides precious land resources for the Japanese people. Meanwhile, as the food base of Japan, the gradual decrease of the agricultural population and more intensive agricultural practices on Hokkaido have led its arable land use to change year by year, which has also caused changes to the whole land use pattern of the entire island of Hokkaido. To realize the sustainable use of land resources in Hokkaido, past and future changes in land use patterns must be investigated, and target-based land use planning suggestions should be given on this basis. This study uses remote sensing and GIS technology to analyze the temporal and spatial changes of land use in Hokkaido during the past two decades. The types of land use include cultivated land, forest, waterbody, construction, grassland, and others, by using the satellite images of the Landsat images in 2000, 2010, and 2019 to achieve this goal to make classification. In addition, this study used the coupled Markov-FLUS model to simulate and analyze the land use changes in three different scenarios in Hokkaido in the next 20 years. Scenario-based situational analysis shows that the cultivated land in Hokkaido will drop by about 25% in 2040 under the natural development scenario (ND), while the cultivated land area in Hokkaido will remain basically unchanged in cultivated land protection scenario (CP). In forest protection scenario (FP), the area of forest in Hokkaido will increase by 1580.8 km2. It is believed that the findings reveal that the forest land in Hokkaido has been well protected in the past and will be protected well in the next 20 years. However, in land use planning for future, Hokkaido government and enterprises should pay more attention to the protection of cultivated land.",
        "date": "2021-07-03",
        "image_url": "https://www.mdpi.com/remotesensing/remotesensing-13-02621/article_deploy/html/images/remotesensing-13-02621-g001-550.jpg",
        "paper_url": "https://doi.org/10.3390/rs13132621"
    },
    {
        "periodical": "Remote Sensing",
        "title": "Novel Intelligent Spatiotemporal Grid Earthquake Early-Warning Model",
        "abstract": "The integration analysis of multi-type geospatial information poses challenges to existing spatiotemporal data organization models and analysis models based on deep learning. For earthquake early warning, this study proposes a novel intelligent spatiotemporal grid model based on GeoSOT (SGMG-EEW) for feature fusion of multi-type geospatial data. This model includes a seismic grid sample model (SGSM) and a spatiotemporal grid model based on a three-dimensional group convolution neural network (3DGCNN-SGM). The SGSM solves the problem concerning that the layers of different data types cannot form an ensemble with a consistent data structure and transforms the grid representation of data into grid samples for deep learning. The 3DGCNN-SGM is the first application of group convolution in the deep learning of multi-source geographic information data. It avoids direct superposition calculation of data between different layers, which may negatively affect the deep learning analysis model results. In this study, taking the atmospheric temperature anomaly and historical earthquake precursory data from Japan as an example, an earthquake early warning verification experiment was conducted based on the proposed SGMG-EEW. Five groups of control experiments were designed, namely with the use of atmospheric temperature anomaly data only, use of historical earthquake data only, a non-group convolution control group, a support vector machine control group, and a seismic statistical analysis control group. The results showed that the proposed SGSM is not only compatible with the expression of a single type of spatiotemporal data but can also support multiple types of spatiotemporal data, forming a deep-learning-oriented data structure. Compared with the traditional deep learning model, the proposed 3DGCNN-SGM is more suitable for the integration analysis of multiple types of spatiotemporal data.",
        "date": "2021-08-29",
        "image_url": "https://www.mdpi.com/remotesensing/remotesensing-13-03426/article_deploy/html/images/remotesensing-13-03426-g001-550.jpg",
        "paper_url": "https://doi.org/10.3390/rs13173426"
    },
    {
        "periodical": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing",
        "title": "A Novel Impervious Surface Extraction Method Based on Automatically Generating Training Samples From Multisource Remote Sensing Products: A Case Study of Wuhan City, China",
        "abstract": "Impervious surfaces caused by rapid urbanization affect the environment and increase the disaster risk. Currently, most articles have extracted impervious surfaces by manual participation for training samples with medium-and-high spatial resolution remote sensing images. Therefore, it is necessary to develop a new method for improving the efficiency of training sample acquisition and the accuracy of impervious surface extraction. In this article, a novel impervious surface extraction method is proposed based on automatically generating training samples from multisource remote sensing products. First, the preliminary sample area was constructed through the overlay analysis of the classification consistency area of three remote sensing products and homogeneous area detection based on Sentinel-2 images. Second, four spectral indices and digital surface model (DSM) elevation data were used for sample selection, and the pixels were further purified by variance purification calculation. Finally, by sample migration and random forest model training, impervious surfaces were extracted for other years with limited data. Wuhan city in China was selected as the study area due to a large number of interior objects for impervious surfaces. Sentinel-2 images from 2018 to 2020, three 30 m-resolution products, and DSM data in 2018 were used. The proposed method's extraction accuracies of impervious surfaces for Wuhan in 2018, 2019, and 2020 are 94.02%, 94.45%, and 93.87%, respectively. Additionally, with the resolution improved up to 10 m, the method is more conducive to distinguishing the boundary between impervious surfaces and pervious surfaces.",
        "date": "2022-08-10",
        "image_url": "https://ieeexplore.ieee.org/mediastore/IEEE/content/media/4609443/9656571/9854083/xiao2-3197760-large.gif",
        "paper_url": "https://doi.org/10.1109/JSTARS.2022.3197760"
    },
    {
        "periodical": "International Journal of Applied Earth Observation and Geoinformation",
        "title": "Prediction of long lead monthly three-dimensional ocean temperature using time series gridded Argo data and a deep learning method",
        "abstract": "Ocean temperature is a vital physical variable of the oceans. Accurately predicting the long lead dynamics of the three-dimensional ocean temperature (3D-OT) can help us identify in advance potential extreme events (e.g., droughts and floods) that may be caused by the changes of the 3D-OT, which however remains a challenge. To achieve this goal, a deep learning (DL) model was proposed to make predictions of the monthly 3D-OT for one year ahead using time series gridded Argo data. The DL model is comprised of a one-dimensional convolution (Conv1D) layer which is used for extracting latent features from the time series ocean temperature data, two long short-term memory (LSTM) layers which are used for capturing the long-term temporal dependencies hidden in the 3D-OT based on the features extracted by the Conv1D layer, and a fully-connected layer to output the predictions. The proposed DL model can well model the temporal dependencies and dynamic patterns of the ocean temperature at different spatial locations and in different depths by learning from simply the historical time series gridded Argo data. Experiments conducted in a sub-area of the South Pacific Ocean that predict the monthly 3D-OT with the lead time from 1 to 12 months show that the developed DL model surpasses the persistence model, the AdaBoost model, and the feedforward backpropagation neural network model (BPNN) when compared from multiple spatiotemporal perspectives using multiple statistics, indicating that the proposed DL model is a highly strong model for long lead monthly 3D-OT predictions.",
        "date": "2022-08-12",
        "image_url": "https://ars.els-cdn.com/content/image/1-s2.0-S1569843222001649-gr1.jpg",
        "paper_url": "https://doi.org/10.1016/j.jag.2022.102971"
    },
    {
        "periodical": "Remote Sensing",
        "title": "Integrating Remote Sensing and Spatiotemporal Analysis to Characterize Artificial Vegetation Restoration Suitability in Desert Areas: A Case Study of Mu Us Sandy Land",
        "abstract": "One of the major barriers to hindering the sustainable development of the terrestrial environment is the desertification process, and revegetation is one of the most significant duties in anti-desertification. Desertification deteriorates land ecosystems through species decline, and remote sensing is becoming the most effective way to monitor desertification. Mu Us Sandy Land is the fifth largest desert and the representative area under manmade vegetation restorations in China. Therefore, it is essential to understand the spatiotemporal characteristics of artificial desert transformation for seeking the optimal revegetation location for future restoration planning. However, there are no previous studies focusing on exploring regular patterns between the spatial distribution of vegetation restoration and human-related geographical features. In this study, we use Landsat satellite data from 1986 to 2020 to achieve annual monitoring of vegetation change by a threshold segmentation method, and then use spatiotemporal analysis with Open Street Map (OSM) data to explore the spatiotemporal distribution pattern between vegetation occurrence and human-related features. We construct an artificial vegetation restoration suitability index (AVRSI) by considering human-related features and topographical factors, and we assess artificial suitability for vegetation restoration by mapping methods based on that index and the vegetation distribution pattern. The AVRSI can be commonly used for evaluating restoration suitability in Sandy areas and it is tested acceptable in Mu Us Sandy Land. Our results show during this period, the segmentation threshold and vegetation area of Mu Us Sandy Land increased at rates of 0.005/year and 264.11 km2/year, respectively. Typically, we found the artificial restoration vegetation suitability in Mu Us area spatially declines from southeast to northwest, but eventually increases in the most northwest region. This study reveals the revegetation process in Mu Us Sandy Land by figuring out its spatiotemporal vegetation change with human-related features and maps the artificial revegetation suitability.",
        "date": "2022-09-22",
        "image_url": "https://www.mdpi.com/remotesensing/remotesensing-14-04736/article_deploy/html/images/remotesensing-14-04736-g002-550.jpg",
        "paper_url": "https://doi.org/10.3390/rs14194736"
    },
    {
        "periodical": "Land",
        "title": "Does COVID-19 Affect the Accessibility of Outdoor Sports Venues? A Case Study in Nanchang, China",
        "abstract": "The COVID-19 pandemic has been a great challenge to society, the economy, and population health. It has become a significant public health event and social problem. Exploring the impact of COVID-19 on the accessibility of outdoor sports venues is crucial for people’s health. Based on spatial theory, the quantitative and qualitative analyses of outdoor sports venues’ spatial distribution and accessibility were conducted, and the epidemic’s impact on them was analyzed. The results show that: (1) The existing outdoor sports venues in Nanchang show a distribution pattern of “sparse in the north and south, and strong aggregation in the middle”. (2) As a result of the epidemic, the center of the standard deviation ellipse in outdoor sports sites shifted to the southeast, while the number of open venues decreased by 68%. (3) Before COVID-19, the entire study area could achieve full coverage by driving for 17 min, riding for 70 min, or walking for 119 min. After COVID-19, the time increased to 29, 109, and 193 min, respectively. (4) Under the high-risk scenario of COVID-19, the average walking time for people to reach outdoor sports venues increased from 6.2 min to 14.0 min in the study area, with an increase of 126%. Finally, according to the findings of this study, recommendations were made on how government departments could build or re-open outdoor sports venues during and after this epidemic.",
        "date": "2023-01-03",
        "image_url": "https://www.mdpi.com/land/land-12-00158/article_deploy/html/images/land-12-00158-g001-550.jpg",
        "paper_url": "https://doi.org/10.3390/land12010158"
    },
    {
        "periodical": "Remote Sensing",
        "title": "Mapping the Age of Subtropical Secondary Forest Using Dense Landsat Time Series Data: An Ensemble Model",
        "abstract": "Quantifying secondary forest age (SFA) is essential to evaluate the carbon processes of forest ecosystems at regional and global scales. However, the successional stages of secondary forests remain poorly understood due to low-frequency thematic maps. This study aimed to estimate SFA with higher frequency and more accuracy by using dense Landsat archives. The performances of four time-series change detection algorithms—moving average change detection (MACD), Continuous Change Detection and Classification (CCDC), LandTrendr (LT), and Vegetation Change Tracker (VCT)—for detecting forest regrowth were first evaluated. An ensemble model was then developed to determine more accurate timings for forest regrowth based on the evaluation results. Finally, after converting the forest regrowth year to the SFA, the spatiotemporal and topographical distributions of the SFA were analyzed. The proposed ensemble model was validated in Jiangxi province, China, which is located in a subtropical region and has experienced drastic forest disturbances, artificial afforestation, and natural regeneration. The results showed that: (1) the developed ensemble model effectively determined forest regrowth time with significantly decreased omission and commission rates compared to the direct use of the four single algorithms; (2) the optimal ensemble model combining the independent algorithms obtained the final SFA for Jiangxi province with the lowest omission and commission rates in the spatial domain (14.06% and 24.71%) and the highest accuracy in the temporal domain (R2 = 0.87 and root mean square error (RMSE) = 3.17 years); (3) the spatiotemporal and topographic distribution from 1 to 34 years in the 2021 SFA map was analyzed. This study demonstrated the feasibility of using change detection algorithms for estimating SFA at regional to national scales and provides a data foundation for forest ecosystem research.",
        "date": "2023-04-14",
        "image_url": "https://www.mdpi.com/remotesensing/remotesensing-15-02067/article_deploy/html/images/remotesensing-15-02067-g002-550.jpg",
        "paper_url": "https://doi.org/10.3390/rs15082067"
    },
    {
        "periodical": "Remote Sensing",
        "title": "Hybrid Deep Learning and S2S Model for Improved Sub-Seasonal Surface and Root-Zone Soil Moisture Forecasting",
        "abstract": "Surface soil moisture (SSM) and root-zone soil moisture (RZSM) are key hydrological variables for the agricultural water cycle and vegetation growth. Accurate SSM and RZSM forecasting at sub-seasonal scales would be valuable for agricultural water management and preparations. Currently, weather model-based soil moisture predictions are subject to large uncertainties due to inaccurate initial conditions and empirical parameterization schemes, while the data-driven machine learning methods have limitations in modeling long-term temporal dependences of SSM and RZSM because of the lack of considerations in the soil water process. Thus, here, we innovatively integrate the model-based soil moisture predictions from a sub-seasonal-to-seasonal (S2S) model into a data-driven stacked deep learning model to construct a hybrid SSM and RZSM forecasting framework. The hybrid forecasting model is evaluated over the Yangtze River Basin and parts of Europe from 1- to 46-day lead times and is compared with four baseline methods, including the support vector regression (SVR), random forest (RF), convolutional long short-term memory (ConvLSTM) and the S2S model. The results indicate substantial skill improvements in the hybrid model relative to baseline models over the two study areas spatiotemporally, in terms of the correlation coefficient, unbiased root mean square error (ubRMSE) and RMSE. The hybrid forecasting model benefits from the long-lead predictive skill from S2S and retains the advantages of data-driven soil moisture memory modeling at short-lead scales, which account for the superiority of hybrid forecasting. Overall, the developed hybrid model is promising for improved sub-seasonal SSM and RZSM forecasting over global and local areas.",
        "date": "2023-07-05",
        "image_url": "https://pub.mdpi-res.com/remotesensing/remotesensing-15-03410/article_deploy/html/images/remotesensing-15-03410-ag-550.jpg?1688555486",
        "paper_url": "https://doi.org/10.3390/rs15133410"
    },
    {
        "periodical": "Remote Sensing",
        "title": "Dynamic Simulation and Prediction of Carbon Storage Based on Land Use/Land Cover Change from 2000 to 2040: A Case Study of the Nanchang Urban Agglomeration",
        "abstract": "Land use/land cover change (LUCC) constitutes a significant contributor to variations in the storage of carbon within ecosystems and holds substantial significance within the context of the carbon cycling process. This study analyzed land use data from the Nanchang urban agglomeration in 2000 and 2020 to investigate changes in land use and carbon storage using the PLUS model and GIS. The results show the following: (1) From 2000 to 2020, the Nanchang urban agglomeration experienced reductions in the extents of croplands, woodlands, grasslands, and unused lands. The predominant trend in land transformation involved the conversion of cropland into built-up land. (2) Between 2000 and 2020, there was a declining trajectory observed in carbon storage for the Nanchang urban agglomeration, with an overall decrease of 1.13 × 107 t. The space is characterized by a high-altitude perimeter and a low-altitude center. Urbanization’s encroachment on cropland is the main reason for declining carbon storage. (3) The predictive outcomes reveal that, in 2040, carbon storage in the Nanchang urban agglomeration will be reduced by 1.00 × 107 t under the natural development scenario, and reduced by 3.90 × 106 t and increased by 2.29 × 105 t, respectively, under the cropland protection and ecological protection scenarios. The risk of carbon loss is significantly reduced by ecological protection policy interventions. Our analysis of the land use patterns and carbon storage distribution in the Nanchang urban agglomeration over the past 20 years and our exploration of the land use change trend over the next 20 years under the conservation policy provide a reference basis for increasing the carbon sink in the core area of the ecological city cluster of Poyang Lake and realizing the sustainable development of the city.",
        "date": "2023-09-22",
        "image_url": "https://www.mdpi.com/remotesensing/remotesensing-15-04645/article_deploy/html/images/remotesensing-15-04645-g002-550.jpg",
        "paper_url": "https://doi.org/10.3390/rs15194645"
    },
    {
        "periodical": "测绘学报",
        "title": "城市群高分辨率不透水面时空连续感知方法研究",
        "abstract": "在城市化过程中，快速扩张的不透水面已成为能够直接表征城市的发展与繁荣程度的重要指标。不透水面改变了城市生态系统中的水、土、气、热等物质和能量的流通方式，改变了局部气候与生态格局，引发了热岛、湿岛、干岛、雨岛及浑浊岛等城市“五岛”效应，直接和间接地导致了城市内涝、环境污染等城市生态与环境问题。论文以实现城市群高分辨率不透水面逐季度时空连续感知为研究目标，从不透水面的感(观测)与知(信息)在时空连续性方面相互推理的角度，提出了一套城市群高分辨率不透水面时空连续感知方法。",
        "date": "2023-11-15",
        "image_url": "http://piccache-cnki-net-s.vpn.jxnu.edu.cn:8080/nxgp/kcms/20241220r/images/gb/kcms8/cnki_new_logo.png",
        "paper_url": "https://kns.cnki.net/kcms2/article/abstract?v=KrjhrmY9aOUMjCXIRuTdsv2LVqI-7UQ1sg9dNYtWSUJmahg97HF3qf8I_aFwV8HF1AEJJQ7qvLXqtfGAZAXMw4UKIVzgQOzA1RCQZvjbQhiQvC7NThtFVGhpcioWn9YLXobbfuJey0VdDDC1T3SwoSgOdN6nb1ozE7Eb7zSoEiY=&uniplatform=NZKPT"
    },
    {
        "periodical": "Remote Sensing",
        "title": "Novel Grid Collection and Management Model of Remote Sensing Change Detection Samples",
        "abstract": "Remote sensing data have become an important data source for urban and regional change detection, owing to their advantages of authenticity, objectivity, immediacy, and low cost. The method of collection and management for remote sensing change detection samples (RS_CDS) assumes a crucial role in the effectiveness of remote sensing intelligent change detection (RSICD). To achieve rapid collection and real-time sharing of RS_CDS, this study proposes a grid collection and management model of RS_CDS based on GeoSOT (GCAM-GeoSOT), including the grid collection method of RS_CDS (GCM-SD) and grid management method of RS_CDS (GMM-SD). To verify the feasibility and retrieval efficiency of GMM-SD, Oracle and PostgreSQL databases were combined and the retrieval efficiency and database capacity were compared with the corresponding spatial databases, Oracle Spatial and PostgreSQL + PostGIS, respectively. The experimental results showed that GMM-SD not only ensures the reasonable capacity consumption of the database but also has a higher retrieval efficiency for the RS_CDS. This results in a noteworthy comprehensive performance enhancement, with a 47.63% improvement compared to Oracle Spatial and a 40.24% improvement compared to PostgreSQL + PostGIS.",
        "date": "2023-11-27",
        "image_url": "https://www.mdpi.com/remotesensing/remotesensing-15-05528/article_deploy/html/images/remotesensing-15-05528-g001-550.jpg",
        "paper_url": "https://doi.org/10.3390/rs15235528"
    },
    {
        "periodical": "Remote Sensing",
        "title": "Construction of an Ecological Security Pattern in Rapidly Urbanizing Areas Based on Ecosystem Sustainability, Stability, and Integrity",
        "abstract": "The escalating pace of urbanization and human activities presents formidable challenges to landuse patterns and ecological environments. Achieving a harmonious coexistence between humans and nature of high quality has emerged as a global imperative. Constructing an ecological security pattern has become an essential approach to mitigating the adverse ecological impacts of urban sprawl, safeguarding human well-being, and promoting the healthy development of ecosystems. Focusing on ecosystem sustainability, stability, and integrity, this study constructed the ecological security pattern in rapidly urbanizing areas, emphasizing achieving a well-balanced integration of urban expansion and ecological preservation. Ecological sources were identified by an evaluation system of “ecosystem service function–ecological sensitivity–landscape connectivity”. Resistance surfaces were constructed by integrating natural and human factors. Ecological corridors and nodes were extracted by methods such as the minimum cumulative resistance and gravity models. Taking Nanchang City as an example, the results show that there were 15 ecological sources, primarily woodland, displaying a distinct “island” phenomenon. Additionally, there were 41 ecological corridors with a combined length of 2170.54 km, exhibiting a dense distribution in the southwest and a sparse distribution in the northeast. The city was found to encompass 122 ecological nodes, predominantly situated along the corridors near the ecological sources, indicating a strong spatial aggregation pattern. An optimized ecological security pattern of “one ring, two belts, three zones, and multiple nodes” was proposed for synergizing ecological protection, restoration, and rapid urbanizing.",
        "date": "2023-12-14",
        "image_url": "https://www.researchgate.net/publication/376561546/figure/fig3/AS:11431281217017201@1705007082302/The-evaluation-system-of-Ecosources.tif",
        "paper_url": "https://doi.org/10.3390/rs15245728"
    },
    {
        "periodical": "IEEE Transactions on Geoscience and Remote Sensing",
        "title": "Thick Cloud Removal in Multitemporal Remote Sensing Images via Low-Rank Regularized Self-Supervised Network",
        "abstract": "The existence of thick clouds covers the comprehensive Earth observation of optical remote sensing images (RSIs). Cloud removal is an effective and economical preprocessing step to improve the subsequent applications of RSIs. Deep learning (DL)-based methods have attracted much attention and achieved state-of-the-art results. However, most of these methods suffer from the following issues: 1) ignore the physical characteristics of RSIs; 2) require paired images with/without cloud or extra auxiliary images (such as SAR); and 3) demand the cloud mask. These issues might have limited the flexibility of existing networks. In this paper, we propose a novel low-rank regularized self-supervised network (LRRSSN) that couples model-driven and data-driven methods to remove the thick cloud from multitemporal remote sensing images (MRSIs). First, motivated by the equal importance of image and cloud components as well as their intrinsic characteristics, we decompose the observed image into low-rank image and structural sparse cloud components. In this way, we obtain a model-driven thick cloud removal method where the spectral-temporal low-rank correlation of the image component and the spectral structural sparsity of the cloud component are effectively exploited. Second, to capture the complex nonlinear features of different scenarios, the data-driven self-supervised network that does not require external training datasets is designed to explore the deep prior of the image component. Third, the coupled model-driven and data-driven LRRSSN is optimized by an efficient half-quadratic splitting algorithm. Finally, without knowing the exact cloud mask, we estimate the cloud mask to preserve information in cloud-free areas as much as possible. Experiments conducted in synthetic and real-world scenarios demonstrate the effectiveness of the proposed approach.",
        "date": "2024-01-25",
        "image_url": "https://ieeexplore.ieee.org/assets/img/ieee_logo_smedia_200X200.png",
        "paper_url": "https://doi.org/10.1109/TGRS.2024.3358493"
    },
    {
        "periodical": "Scientific Data",
        "title": "Mapping of secondary forest age in China using stacked generalization and Landsat time series",
        "abstract": "A national distribution of secondary forest age (SFA) is essential for understanding the forest ecosystem and carbon stock in China. While past studies have mainly used various change detection algorithms to detect forest disturbance, which cannot adequately characterize the entire forest landscape. This study developed a data-driven approach for improving performances of the Vegetation Change Tracker (VCT) and Continuous Change Detection and Classification (CCDC) algorithms for detecting the establishment of forest stands. An ensemble method for mapping national-scale SFA by determining the establishment time of secondary forest stands using change detection algorithms and dense Landsat time series was proposed. A dataset of national secondary forest age for China (SFAC) for 1 to 34 and with a 30-m spatial resolution was produced from the optimal ensemble model. This dataset provides national, continuous spatial SFA information and can improve understanding of secondary forests and the estimation of forest carbon storage in China.",
        "date": "2024-03-16",
        "image_url": "https://www.researchgate.net/publication/379024083/figure/fig4/AS:11431281229790961@1710647565317/Schematic-representation-of-the-process-used-for-mapping-secondary-forest-age-in-the.png",
        "paper_url": "https://doi.org/10.1038/s41597-024-03133-2"
    },
    {
        "periodical": "IEEE Geoscience and Remote Sensing Letters",
        "title": "Unidirectional Spatial and Spectral Smoothed Tensor Ring Decomposition for Hyperspectral Image Denoising and Destriping",
        "abstract": "In this letter, we propose a novel unidirectional spatial and spectral smoothed tensor ring decomposition (U3STR) for hyperspectral image (HSI) denoising and destriping. The powerful tensor ring (TR) decomposition is introduced to explore the global spatial-spectral correlation of HSI, which transforms the restoration of HSI into estimating three TR factors. To address the local spatial-spectral smoothness of HSI and the directional characteristic of stripe noise, unidirectional spatial and spectral smoothed constraints are applied to the horizontal spatial and spectral TR factors, respectively. Moreover, considering the stripe noise shares spatial correlation and local smoothness with the image component, we strategically utilize band-by-band low-rank and unidirectional total variation (TV) regularization, effectively disentangling stripe noise from the image content without conflicting the image regularization. The proposed U3STR model is solved by the alternating direction method of multipliers (ADMM) algorithm effectively. Experimental results demonstrate that our method outperforms other HSI restoration methods in denoising and destriping, notably enhancing the quality of the restored image by an average of 3 dB over existing methods.",
        "date": "2024-06-11",
        "image_url": "https://ieeexplore.ieee.org/document/10553229/metrics#metrics",
        "paper_url": "https://doi.org/10.1109/LGRS.2024.3412804"
    },
    {
        "periodical": "中国科学数据",
        "title": "2000-2020年鄱阳湖环湖区生态安全格局研究数据集",
        "abstract": "随着人类活动的不断扩张和发展，许多物种的栖息地面临着严重的破坏和威胁，生态安全问题日益突出。因此，构建一个考虑物种栖息地的生态安全格局对于保护生物多样性和维持生态平衡至关重要。鄱阳湖作为野生动物的天堂，是许多鸟类、鱼类和其他水生生物物种的栖息地和繁殖地。以鄱阳湖环湖区研究范围为例，基于Google Earth Engine平台与随机森林分类方法制作了2000年、2010、2020年鄱阳湖环湖区的土地利用数据。根据形态空间格局分析、景观格局指数、景观连通性指数和电路理论等与长时间序列土地利用数据相结合，构建考虑物种（鱼类、鸟类等）栖息地2000–2020年鄱阳湖环湖区长时间序列生态安全格局。本数据集包含了多种数据类型，并且其中一些数据具有创新性。在数据质量控制和评估方面，对所使用的数据进行了严格的质量控制和评估，以确保数据的准确性和可信度。数据集不仅包含了考虑物种栖息地构建生态安全格局的指标数据，还包括考虑物种栖息地鄱阳湖环湖区生态安全格局历史结果数据，可作为基础科学数据为今后鄱阳湖环湖区物种保护与生态安全格局等相关研究提供重要的数据支持与参考。",
        "date": "2024-06-15",
        "image_url": "http://kns-cnki-net-s.vpn.jxnu.edu.cn:8080/nzkhtml/resource/CJFD/KXGZ202402031/images/KXGZ202402031_12100.jpg",
        "paper_url": "https://kns.cnki.net/kcms2/article/abstract?v=KrjhrmY9aOWob92c1Txl683T5hMz9kE0WI-e1EyQ6LPhc9aGprB5r3mwhDlOq0dcPa4R1Z9-P1Nq18qwwLfqAX16Bjq-43uW9PIYWATyIHCaSluMHKV2CjFbX2MbUbh-T7eFBIdOTfFp6dxjPP2qgTRGH7-8zDsPfNpTt6TZGXo=&uniplatform=NZKPT"
    },
    {
        "periodical": "International Journal of Digital Earth",
        "title": "Spatiotemporal dynamics and forecasting of ecological security pattern under the consideration of protecting habitat: a case study of the Poyang Lake ecoregion",
        "abstract": "The continuous expansion and development of anthropogenic activities pose considerable threats to the habitats of myriad species. Therefore, exploring how to protect and optimize species’ habitats to achieve harmony between humans and nature is particularly important. As a paradise for wildlife, Poyang Lake is the habitat and breeding ground for birds, fish, and other aquatic organisms. In this study, adopting a multi-level perspective of ‘point-line-area’, we had an appliance for habitat conservation by constructing an ecological security pattern (ESP) in the Poyang Lake Ecoregion (PYLE). We produced land use and land cover from 2000 to 2040 using the random forest and cellular automata-Markov model. Combining morphological spatial pattern analysis, landscape pattern index, and Linkage Mapper, we constructed a long-term ESP in the PYLE considering habitat protection. The spatiotemporal dynamics of ESP were compared and analyzed. The results show that PYLE's rapid economic development led to extensive urban growth, encroaching on surrounding bare land, which could undermine local species’ survival. Based on PYLE's predicted ESP in 2040, we propose an optimized ‘one area, two zones, and multiple points’ scheme to prioritize habitat protection. This comprehensive study provides innovative ideas and novel insights for future research and policy formulation in habitat protection.",
        "date": "2024-07-10",
        "image_url": "https://www.tandfonline.com/cms/asset/74f3ef87-161a-40e6-9d5a-afd4754fe691/tjde_a_2376277_f0002_oc.jpg",
        "paper_url": "https://doi.org/10.1080/17538947.2024.2376277"
    },
    {
        "periodical": "Remote Sensing",
        "title": "Flood Inundation Probability Estimation by Integrating Physical and Social Sensing Data: Case Study of 2021 Heavy Rainfall in Henan, China",
        "abstract": "Frequent flooding seriously affects people’s safety and economic construction, and assessing the inundation probability can help to strengthen the capacity of emergency management of floods. There are currently two general means of flood sensing: physical and social. Remote sensing data feature high reliability but are often unavailable in disasters caused by persistent heavy rainfall. Social media is characterized by high timeliness and a large data volume but has high redundancy and low reliability. The existing studies have primarily relied on physical sensing data and have not fully exploited the potential of social media data. This paper combines traditional physical sensing data with social media and proposes an integrated physical and social sensing (IPS) method to estimate the probability distribution of flood inundation. Taking the “7·20” Henan rainstorm in 2021 and the study area of Xinxiang, China, as a case study, more than 60,000 messages and 1900 images about this occurrence were acquired from the Weibo platform. Taking filtered water depth points with their geographic location and water depth information as the main input, the inverse distance attenuation function was used to calculate the inundation potential layer of the whole image. Then, the Gaussian kernel was used to weight the physical sensing data based on each water depth point, and finally, the submergence probability layer of the whole image was enhanced. In the validation of the results using radar and social media points, accuracies of 88.77% and 75% were obtained by setting up a threshold classification, demonstrating the effectiveness and usefulness of the method. The significance of this study lies in obtaining discrete social media flood points and achieving space-continuous flood inundation probability mapping, providing decision-making support for urban flood diagnosis and mitigation.",
        "date": "2024-07-26",
        "image_url": "https://www.mdpi.com/remotesensing/remotesensing-16-02734/article_deploy/html/images/remotesensing-16-02734-g005-550.jpg",
        "paper_url": "https://doi.org/10.3390/rs16152734"
    },
    {
        "periodical": "Remote Sensing",
        "title": "A Novel Framework for Integrally Evaluating the Impacts of Climate Change and Human Activities on Water Yield Services from Both Local and Global Perspectives",
        "abstract": "With global climate change and irrational human activities, regional water resource conflicts are becoming more and more pronounced. The availability of water resource in watersheds can be indicated by the water yield. Exploring the factors that influence the water yield is crucial in responding to climate change and protecting water resource. Previous research on the factors influencing the water yield has frequently adopted a macro-level perspective, which has failed to reflect the influencing mechanisms of changes at the local scale adequately. Therefore, this study proposes a novel framework for integrally evaluating the impacts of climate change and human activities on water yield services from both local and global perspectives. Taking Ganzhou City, the source of the Ganjiang River, as an example, the results show the following: (1) Ganzhou City had the largest water yield of 1307.29 mm in 2016, and the lowest was only 375.32 mm in 2011. The spatial distribution pattern was mainly affected by the surface environment, and the high-value water yield regions in the study area were predominantly located in urban areas with flat terrain. (2) At the local scale, regions where human activities contribute more than 80% accounted for 25% of the area. In comparison, the impact of climate change accounted for 0.95%. The contribution rate of human activities to the water yield in Ganzhou City was significantly greater than that of climate change. (3) At the global scale, the simulation results of four scenarios show that climate change contributed (>98%) to the water yield, which is significantly higher than human activities (<2%). This study puts forward pioneering views on the research of water yield driving forces and provides a valuable theoretical basis for water resource protection and ecological environment construction.",
        "date": "2024-08-16",
        "image_url": "https://www.mdpi.com/remotesensing/remotesensing-16-03008/article_deploy/html/images/remotesensing-16-03008-g002-550.jpg",
        "paper_url": "https://doi.org/10.3390/rs16163008"
    },

    {
        "periodical": "International Journal of Applied Earth Observation and Geoinformation",
        "title": "Category-sensitive semi-supervised semantic segmentation framework for land-use/land-cover mapping with optical remote sensing images",
        "abstract": "High-quality land-use/land-cover mapping with optical remote sensing images yet presents significant work. Even though fully convolutional semantic segmentation models have recently contributed to popular solutions, the lack of annotation data may lead to severe degradations in their inference performance. Besides, the category confusion in high-resolution representations will further exacerbate the adverse effects. In this paper, we propose a category-sensitive semi-supervised semantic segmentation framework to address these weaknesses by employing massive unlabeled data. With the perturbations from adopted hybrid data augmentation structures, we first focus on the output space and execute regularization constraints to learn category-specific discriminative features. It is formulated with a consistency self-training procedure where a dynamic class-balanced threshold selection scheme is proposed to provide high-confident pseudo supervisions for each category. In addition, we introduce pixel-wise contrastive learning on the common embedding space from both labeled and unlabeled data domains to further facilitate the semantic dependencies among category features, in which the reliable labels are leveraged as guidance for pixel sample selection. We verify the proposed framework on two benchmark land-use/land-cover datasets, and the experimental results demonstrate its competitive performance to other state-of-the-art semi-supervised methods.",
        "date": "2024-09-14",
        "image_url": "https://ars.els-cdn.com/content/image/1-s2.0-S1569843224005168-gr1.jpg",
        "paper_url": "https://doi.org/10.1016/j.jag.2024.104160"
    },
    {
        "periodical": "Science of The Total Environment ",
        "title": "Spatiotemporal evolution of land use efficiency in 357 cities across mainland China from 2000 to 2020 based on SDG 11.3.1",
        "abstract": "High-efficiency land use facilitates the maximization of land utilization, lowers urban construction costs, and optimizes urban functional patterns. The Sustainable Development Goal 11.3.1 (SDG 11.3.1) can be used to assess land use efficiency (LUE), understand the current state of land use, and identify the potential for optimization. This study combines SDG 11.3.1 with other supplementary indicators to establish a land use efficiency evaluation system. This system provides a more precise understanding of internal city changes and enables a scientific assessment of urban LUE in Mainland China. The results showed that: (1) A significant number of cities were growing cities, particularly in the eastern region, with the population of built-up areas increased by 2.92 times from 2000 to 2020; (2) From 2000 to 2020, cities in China underwent rapid urban expansion, with the most significant urban expansion index in 2015–2020; (3) The coordination between population growth rate (PGR) and land consumption rate (LCR) worsened in the western region, while the central and eastern regions showed better coordination. (4) As the urban expansion index increased, the compactness index of the cities in the above three regions decreased and were at lower levels. This study establishes an evaluation system to assess the LUE and reveals the spatial and temporal characteristics of urban and population change. It holds paramount significance in enhancing LUE and encouraging sustainable development in Mainland China and serves as a valuable reference for global urban management.",
        "date": "2024-09-16",
        "image_url": "https://ars.els-cdn.com/content/image/1-s2.0-S0048969724063137-ga1.jpg",
        "paper_url": "https://doi.org/10.1016/j.scitotenv.2024.176157"
    },

    {
        "periodical": "Remote Sensing",
        "title": "GeoAI and EO Big Data Driven Advances in Earth Environmental Science",
        "abstract": "This Special Issue aims at methodological or applied studies using GeoAI and EO big data for investigating the matter, energy, and information in the hydrosphere, lithosphere, biosphere, and atmosphere on the surface of the Earth.",
        "date": "2025-05-15",
        "image_url": "https://www.researchgate.net/profile/Min-Huang-34/publication/365892388/figure/fig1/AS:11431281300568383@1735597848112/GeoAI-and-EO-Big-Data-Driven-Advances-in-Earth-Environmental-Science_W640.jpg",
        "paper_url": "https://www.mdpi.com/journal/remotesensing/special_issues/FLT4P524M9"
    }
]